In [1]:
import pandas as pd
import numpy as np

In [2]:
maths = pd.read_excel('Python_Assignment.xlsx,sheet_name='Maths')

In [3]:
maths.head()

   Roll No  Class  Theory Marks  Numerical Marks  Practical Marks
0       50      6            75               34               38
1       37      7            68               37               48
2        1      8            75               31               64
3       47      6            70               84               39
4       30      8            82               91               68

In [4]:
phy = pd.read_excel('Python_Assignment.xlsx',sheet_name='Physics')

In [5]:
hindi = pd.read_excel('Python_Assignment.xlsx',sheet_name='Hindi')

In [6]:
eco = pd.read_excel('Python_Assignment.xlsx',sheet_name='Economics')

In [7]:
music = pd.read_excel('Python_Assignment.xlsx',sheet_name='Music')

In [31]:
phy.head()

   Roll No  Class  Theory Marks  Numerical Marks  Practical Marks
0        9     10            97               96               62
1        5      7            74               74               65
2       46      8            40               34               63
3       47      8            40               86               89
4       21      7            80               76               92

In [32]:
hindi.head()

   Roll No  Class  Marks
0       39      6     98
1       43      9     67
2       16      9     62
3       17      6     36
4       10      7     96

In [33]:
eco.head()

   Roll No  Class  Theory Marks  Numerical Marks
0       49      8            47               53
1       36      6            85               31
2       17     10            48               38
3        6      8            31               53
4       56      7            63               70

In [35]:
music.head()

   Roll No  Class  Theory Marks  Practical Marks
0       35      8            40               43
1       29     10            74               83
2       32     10            65               85
3       50      9            38               96
4       43      7            42               32

In [62]:
maths['%maths'] = (((maths['Theory Marks'] + maths['Numerical Marks'] + maths['Practical Marks'])/300)*100).round(2)

In [66]:
maths.drop(['Theory Marks','Numerical Marks','Practical Marks','%math'],axis=1,inplace=True)

In [67]:
maths.head()

   Roll No  Class  %maths
0       50      6   49.00
1       37      7   51.00
2        1      8   56.67
3       47      6   64.33
4       30      8   80.33

In [68]:
eco.head()

   Roll No  Class  Theory Marks  Numerical Marks
0       49      8            47               53
1       36      6            85               31
2       17     10            48               38
3        6      8            31               53
4       56      7            63               70

In [69]:
eco['%eco'] = (((eco['Theory Marks']+eco['Numerical Marks'])/200)*100).round(2)

In [71]:
eco.drop(['Theory Marks','Numerical Marks'],axis=1,inplace=True)

In [72]:
eco.head()

   Roll No  Class  %eco
0       49      8  50.0
1       36      6  58.0
2       17     10  43.0
3        6      8  42.0
4       56      7  66.5

In [74]:
hindi['%hindi'] = hindi['Marks'].round(2)
hindi.drop('Marks',axis=1,inplace=True)

In [75]:
hindi.head()

   Roll No  Class  %hindi
0       39      6      98
1       43      9      67
2       16      9      62
3       17      6      36
4       10      7      96

In [76]:
music.head()

   Roll No  Class  Theory Marks  Practical Marks
0       35      8            40               43
1       29     10            74               83
2       32     10            65               85
3       50      9            38               96
4       43      7            42               32

In [77]:
music['%music'] = (((music['Theory Marks']+music['Practical Marks'])/200)*100).round(2)
music.drop(['Theory Marks','Practical Marks'],axis=1,inplace=True)

In [78]:
music.head()

   Roll No  Class  %music
0       35      8    41.5
1       29     10    78.5
2       32     10    75.0
3       50      9    67.0
4       43      7    37.0

In [79]:
phy.head()

   Roll No  Class  Theory Marks  Numerical Marks  Practical Marks
0        9     10            97               96               62
1        5      7            74               74               65
2       46      8            40               34               63
3       47      8            40               86               89
4       21      7            80               76               92

In [80]:
phy['%phy'] = (((phy['Theory Marks'] + phy['Numerical Marks'] + phy['Practical Marks'])/300)*100).round(2)
phy.drop(['Theory Marks','Numerical Marks','Practical Marks'],axis=1,inplace=True)

In [81]:
phy.head()

   Roll No  Class   %phy
0        9     10  85.00
1        5      7  71.00
2       46      8  45.67
3       47      8  71.67
4       21      7  82.67

In [82]:
maths.head()

   Roll No  Class  %maths
0       50      6   49.00
1       37      7   51.00
2        1      8   56.67
3       47      6   64.33
4       30      8   80.33

In [85]:
df1 = pd.merge(maths,phy,on = ['Roll No','Class'],how = 'outer')

In [87]:
df1.tail()

     Roll No  Class  %maths   %phy
297       59      6     NaN  70.33
298       44      7     NaN  66.67
299       33      9     NaN  65.00
300       58      9     NaN  65.33
301       27     10     NaN  65.00

In [88]:
df2 = pd.merge(df1,eco,on = ['Roll No','Class'],how = 'outer')

In [89]:
df2.head()

   Roll No  Class  %maths   %phy  %eco
0       50      6   49.00  77.67  75.0
1       37      7   51.00  66.67  72.5
2        1      8   56.67  65.33  78.5
3       47      6   64.33  57.00   NaN
4       30      8   80.33  59.00  52.5

In [90]:
df2[df2['Roll No']==50]

     Roll No  Class  %maths   %phy  %eco
0         50      6   49.00  77.67  75.0
111       50      8   68.67  71.00  90.5
143       50     10   54.00  62.33   NaN
193       50      7     NaN  74.00  73.5
239       50      9     NaN  46.33   NaN

In [91]:
df3 = pd.merge(df2,hindi,on = ['Roll No','Class'],how = 'outer')

In [92]:
df = pd.merge(df3,music,on = ['Roll No','Class'],how = 'outer')

In [95]:

df.head()

   Roll No  Class  %maths   %phy  %eco  %hindi  %music
0       50      6   49.00  77.67  75.0    86.0    67.5
1       37      7   51.00  66.67  72.5    87.0    62.5
2        1      8   56.67  65.33  78.5     NaN    59.0
3       47      6   64.33  57.00   NaN    92.0     NaN
4       30      8   80.33  59.00  52.5    99.0    60.0

In [97]:
# no. of students enrolled with the tution provider
df['Roll No'].count()

319

In [98]:
# no of students taken all 5 subjects
df.dropna()['Roll No'].count()

37

In [114]:
# class which has most no. of students
df['Class'].value_counts()

10    60
9     60
8     60
7     60
6     60
5     19
Name: Class, dtype: int64

10    60
9     60
8     60
7     60
6     60
5     19
Name: Class, dtype: int64

In [113]:
df[df['Class']==6].count()

Roll No    60
Class      60
%maths     20
%phy       55
%eco       35
%hindi     47
%music     34
dtype: int64

In [115]:
df['%total'] = (df['%maths']+df['%eco']+df['%hindi']+df['%music']+df['%phy'])/5

In [116]:
df.head()

   Roll No  Class  %maths   %phy  %eco  %hindi  %music  %total
0       50      6   49.00  77.67  75.0    86.0    67.5  71.034
1       37      7   51.00  66.67  72.5    87.0    62.5  67.934
2        1      8   56.67  65.33  78.5     NaN    59.0     NaN
3       47      6   64.33  57.00   NaN    92.0     NaN     NaN
4       30      8   80.33  59.00  52.5    99.0    60.0  70.166

In [130]:
df.dropna().groupby('Class').mean()['%total'].sort_values(ascending=False).iloc[0:2]

Class
6    71.672000
9    70.067143
Name: %total, dtype: float64

In [123]:
{'maths':df['%maths'].mean(),'eco':df['%eco'].mean()}

{'maths': 64.58931972789117, 'eco': 64.82417582417582}

In [132]:
df.describe().loc['50%']

Roll No    31.000
Class       8.000
%maths     64.330
%phy       65.330
%eco       64.000
%hindi     66.000
%music     63.000
%total     67.834
Name: 50%, dtype: float64